namespace NexusEngine {

	/*-----------------------------------------------------------------------------------------
	 * NexusFramework
	 * - 本エンジンのフレームワーク
	 * - エンジンの初期化、シャットダウンなどの基本的な機能を提供する
	 *---------------------------------------------------------------------------------------*/
	class NexusFramework {
	public:
		//===================================================================*/
		//                    public methods
		//===================================================================*/
		NexusFramework()noexcept;
		~NexusFramework()noexcept;

		/**
		 * @brief engineの実行
		 */
		void Run();

	};

}